app/Models/KomikModel.php

    public function getKomik($slug = false){

        if($slug === false){
           return $this->findAll();
        }
        return $this->where('slug', $slug)->find();
---
SELECT *
FROM `komik`
SELECT *
FROM `komik`
WHERE `slug` = '...'